<?php

use Illuminate\Database\Seeder;

class CardTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('card')->delete();
        
        \DB::table('card')->insert(array (
            0 => 
            array (
                'id' => 1,
                'name' => 'หมาป่า',
                'effect' => 'ตื่นขึ้นเวลากลางคืนพร้อมกับหมาป่าตัวอื่น แล้วเลือกผู้เล่นที่ต้องการสังหารได้',
                'image' => '/Image/IMG_0610.jpg',
                'point' => -6,
                'created_at' => '2017-06-13 14:57:43',
                'updated_at' => '2017-07-01 11:23:30',
            ),
            1 => 
            array (
                'id' => 2,
                'name' => 'ลูกหมาป่า',
                'effect' => 'ตื่นขึ้นพร้อมกับหมาป่า ถ้าคุณถูกสังหาร คืนต่อมา หมาป่าจะสามาถสังหารผู้เล่นได้ 2 คน',
                'image' => '/Image/IMG_0609.jpg',
                'point' => -8,
                'created_at' => '2017-06-13 15:00:25',
                'updated_at' => '2017-07-01 11:28:50',
            ),
            2 => 
            array (
                'id' => 3,
                'name' => 'ชาวบ้าน',
                'effect' => 'ตามหาหมาป่าแล้วสังหารซะ',
                'image' => '/Image/IMG_0573.jpg',
                'point' => 1,
                'created_at' => '2017-06-13 08:39:11',
                'updated_at' => '2017-07-01 11:38:34',
            ),
            3 => 
            array (
                'id' => 5,
                'name' => 'ช่างก่อสร้าง',
                'effect' => 'ในคืนแรกสามารถตื่นขึ้นมาเพื่อมองหา ช่างก่อสร้างคนอื่นๆได้ โดยช่างก่อสร้างห้ามให้ผู้เล่นอื่นรู้ และช่างก่อสร้างห้ามคุยกันเอง',
                'image' => '/Image/IMG_0572.jpg',
                'point' => 2,
                'created_at' => '2017-06-13 08:41:41',
                'updated_at' => '2017-07-01 11:42:13',
            ),
            4 => 
            array (
                'id' => 6,
                'name' => 'บอดี้การ์ด',
                'effect' => 'ใน 1 คืน สามารถเลือกปกป้องผู้เล่นได้ 1 คน โดยห้ามเลือกผู้เล่นซ้ำติดกัน 2 คืน ผู้เล่นที่ถูกเลือก จะไม่โดนสังหารในคืนนั้น',
                'image' => '/Image/IMG_0595.jpg',
                'point' => 3,
                'created_at' => '2017-06-20 07:44:27',
                'updated_at' => '2017-07-01 11:41:33',
            ),
            5 => 
            array (
                'id' => 7,
                'name' => 'ผู้หยั่งรู้',
                'effect' => 'ใน 1 คืน สามารถเลือกชี้ผู้เล่นได้ โดยที่ Mod จำเป็นต้องบอกว่า ผู้เล่นนั้นเป็นหมาป่าหรือไม่',
                'image' => '/Image/IMG_0611.jpg',
                'point' => 7,
                'created_at' => '2017-06-20 07:46:06',
                'updated_at' => '2017-07-01 11:44:10',
            ),
            6 => 
            array (
                'id' => 8,
                'name' => 'Mod',
                'effect' => 'คุณเป็น Mod',
                'image' => '/Image/IMG_0569.jpg',
                'point' => 0,
                'created_at' => '2017-06-30 08:01:18',
                'updated_at' => '2017-07-08 07:27:12',
            ),
        ));
        
        
    }
}