<?php

use Illuminate\Database\Seeder;

class CardTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('card')->delete();
        
        \DB::table('card')->insert(array (
            0 => 
            array (
                'id' => 1,
                'name' => 'หมาป่า',
                'effect' => 'ตื่นขึ้นเวลากลางคืนพร้อมกับหมาป่าตัวอื่น <br> แล้วเลือกผู้เล่นที่ต้องการสังหารได้',
                'image' => '/Image/IMG_0610.jpg',
                'point' => -6,
                'created_at' => '2017-06-13 14:57:43',
                'updated_at' => '2017-07-08 11:38:03',
            ),
            1 => 
            array (
                'id' => 2,
                'name' => 'ลูกหมาป่า',
                'effect' => 'ตื่นขึ้นพร้อมกับหมาป่า ถ้าถูกสังหาร <br> ไม่ว่าวิธีใด คืนนั้นหมาป่าจะสามาถสังหารผู้เล่นได้ 2 คน',
                'image' => '/Image/IMG_0609.jpg',
                'point' => -8,
                'created_at' => '2017-06-13 15:00:25',
                'updated_at' => '2017-07-08 15:08:21',
            ),
            2 => 
            array (
                'id' => 3,
                'name' => 'ชาวบ้าน',
                'effect' => 'ตามหาหมาป่าแล้วสังหารซะ',
                'image' => '/Image/IMG_0573.jpg',
                'point' => 1,
                'created_at' => '2017-06-13 08:39:11',
                'updated_at' => '2017-07-01 11:38:34',
            ),
            3 => 
            array (
                'id' => 5,
                'name' => 'ช่างก่อสร้าง',
                'effect' => 'ในคืนแรกสามารถตื่นขึ้นมาเพื่อมองหา ช่างก่อสร้างคนอื่นๆได้ โดยช่างก่อสร้างห้ามให้ผู้เล่นอื่นรู้ และช่างก่อสร้างห้ามคุยกันเอง',
                'image' => '/Image/IMG_0572.jpg',
                'point' => 2,
                'created_at' => '2017-06-13 08:41:41',
                'updated_at' => '2017-07-01 11:42:13',
            ),
            4 => 
            array (
                'id' => 6,
                'name' => 'บอดี้การ์ด',
                'effect' => 'ใน 1 คืน สามารถเลือกปกป้องผู้เล่นได้ 1 คน โดยห้ามเลือกผู้เล่นซ้ำติดกัน 2 คืน ผู้เล่นที่ถูกเลือก จะไม่โดนสังหารในคืนนั้น',
                'image' => '/Image/IMG_0595.jpg',
                'point' => 3,
                'created_at' => '2017-06-20 07:44:27',
                'updated_at' => '2017-07-01 11:41:33',
            ),
            5 => 
            array (
                'id' => 7,
                'name' => 'ผู้หยั่งรู้',
                'effect' => 'ใน 1 คืน สามารถเลือกชี้ผู้เล่นได้ โดยที่ Mod จำเป็นต้องบอกว่า ผู้เล่นนั้นเป็นหมาป่าหรือไม่',
                'image' => '/Image/IMG_0611.jpg',
                'point' => 7,
                'created_at' => '2017-06-20 07:46:06',
                'updated_at' => '2017-07-01 11:44:10',
            ),
            6 => 
            array (
                'id' => 8,
                'name' => 'Mod',
                'effect' => 'คุณเป็น Mod',
                'image' => '/Image/IMG_0569.jpg',
                'point' => 0,
                'created_at' => '2017-06-30 08:01:18',
                'updated_at' => '2017-07-08 07:27:12',
            ),
            7 => 
            array (
                'id' => 9,
                'name' => 'นายพราน',
                'effect' => 'เมื่อตาย ไม่ว่าจะโดนหมาป่าสังหาร หรือคนโหวตเผา จะสามารถเลือกสังหารคนอื่น ได้อีก 1 คน ทันที',
                'image' => '1',
                'point' => 3,
                'created_at' => '2017-07-08 10:18:30',
                'updated_at' => '2017-07-08 11:12:24',
            ),
            8 => 
            array (
                'id' => 10,
                'name' => 'คนเป็นโรค',
                'effect' => 'ถ้าถูกหมาป่ากิน หมาป่าจะท้องเสีย และคืนถัดไปหมาป่าจะไม่สามารถสังหารคนได้ 1 คืน',
                'image' => '1',
                'point' => 3,
                'created_at' => '2017-07-08 11:10:35',
                'updated_at' => '2017-07-08 11:10:35',
            ),
            9 => 
            array (
                'id' => 11,
                'name' => 'เจ้าชาย',
                'effect' => 'เมื่อถูกโหวตเผา ให้แสดงตัวว่าเป็น "เจ้าชาย" แล้วจะถูกรอดจากการเผาครั้งนั้นได้',
                'image' => '1',
                'point' => 3,
                'created_at' => '2017-07-08 11:11:38',
                'updated_at' => '2017-07-08 11:16:25',
            ),
            10 => 
            array (
                'id' => 12,
                'name' => ',มนุษย์หมาป่า',
                'effect' => 'เป็นชาวบ้านธรรมดา
แต่เวลาที่ "ผู้หยั่งรู้" ชี้มาทีตัว "Mod" จะบอกว่าเป็น "หมาป่า"',
                'image' => '1',
                'point' => -1,
                'created_at' => '2017-07-08 11:16:08',
                'updated_at' => '2017-07-08 11:16:08',
            ),
            11 => 
            array (
                'id' => 13,
                'name' => 'จอมเวท',
                'effect' => 'ช่วงกลางคืน
เลือกความสามารถพิเศษ 2 อย่าง 
<ol>
<li>ชุบชีวิตคนตาย</li>
<li>สังหารคนอื่น</li>
</ol>
โดยความสามารถเหล่านี้จะใช้ได้ 2 ครั้ง ต่อ 1 เกม 
<br>โดยทั้ง 2 ครั้ง จะเป็นความสามารถอย่างเดียวกันได้',
                'image' => '1',
                'point' => 4,
                'created_at' => '2017-07-08 11:19:27',
                'updated_at' => '2017-07-08 11:24:04',
            ),
            12 => 
            array (
                'id' => 14,
                'name' => 'คนสาปใบ้',
                'effect' => 'ใน 1 คืน จะสามารถเลือกคนได้ 1 คน <br> 
แล้ววันต่อมา คนที่ลูกเลือกจะไม่สามารถพูดอะไรได้จนกว่า จะผ่านวันนั้นไป แต่สามารถร่วมโหวตเผาได้<br> ตามปกติ',
                'image' => '1',
                'point' => 1,
                'created_at' => '2017-07-08 11:36:25',
                'updated_at' => '2017-07-08 11:37:53',
            ),
            13 => 
            array (
                'id' => 15,
                'name' => 'ศิษย์ของผู้หยั่งรู้',
                'effect' => 'เมื่อ "ผู้หยั่งรู้" ถูกสังหาร จะกลายเป็น "ผู้หยั่งรู้" คนต่อไปทันที',
                'image' => '1',
                'point' => 4,
                'created_at' => '2017-07-08 14:39:58',
                'updated_at' => '2017-07-08 14:39:58',
            ),
            14 => 
            array (
                'id' => 16,
                'name' => 'คนถึก',
                'effect' => 'เมื่อถูกหมาป่าสังหาร ในคืนนั้นเขายังไมา่ตายในทันที โดยที่เขาจะต้องตายในคืนถัดไป',
                'image' => '1',
                'point' => 3,
                'created_at' => '2017-07-08 14:44:13',
                'updated_at' => '2017-07-08 14:44:13',
            ),
            15 => 
            array (
                'id' => 17,
                'name' => 'นายกเทศมนตรี',
                'effect' => 'เมื่อเปิดเผยตัวตน จะมีสิทธิ์โหวตเผา ได้ 2 เสียง',
                'image' => '1',
                'point' => 2,
                'created_at' => '2017-07-08 14:46:17',
                'updated_at' => '2017-07-08 14:46:17',
            ),
            16 => 
            array (
                'id' => 18,
                'name' => 'หมอผั',
                'effect' => 'ใน 1 คืน สามารถเลือกชี้ผู้เล่นได้ โดยที่ Moderator จำเป็นต้องบอกว่า ผู้เล่นนั้นเป็น "ผู้หยั่งรูั้" หรือไม่',
                'image' => '1',
                'point' => -3,
                'created_at' => '2017-07-08 14:48:08',
                'updated_at' => '2017-07-08 14:48:08',
            ),
            17 => 
            array (
                'id' => 19,
                'name' => 'คนต้องสาป',
                'effect' => 'เมื่อถูกหมาป่าสังหาร ในคือนต่อจะได้เป้น "หมาป่า" ทันที',
                'image' => '1',
                'point' => -3,
                'created_at' => '2017-07-08 14:49:52',
                'updated_at' => '2017-07-08 14:49:52',
            ),
            18 => 
            array (
                'id' => 20,
                'name' => 'คนสองร่าง',
                'effect' => 'ในคืนแรก จะสามารถเลือกผู้เล่นได้ 1 คน เมื่อผู้เล่นั้นตาย จะมีความสามารถเหมือนผู้เล่นั้น ทุกประการ',
                'image' => '1',
                'point' => -2,
                'created_at' => '2017-07-08 14:51:55',
                'updated_at' => '2017-07-08 14:51:55',
            ),
            19 => 
            array (
                'id' => 21,
                'name' => 'กามเทพ',
                'effect' => 'ในคืนแรก จะสามารถเลือกผู้เล่นได้ 2 คน  <br>
ระหว่างเกม ถ้าเกิดมีคนใดคนหนึ่งตาย อีกคนก็จะต้องตายตามไปด้วย',
                'image' => '1',
                'point' => -3,
                'created_at' => '2017-07-08 14:54:37',
                'updated_at' => '2017-07-08 14:54:37',
            ),
            20 => 
            array (
                'id' => 22,
                'name' => 'แวมไพร์',
                'effect' => 'ใน 1 คืน สามารถเลือกผู้เล่น 1 คน แล้วคนนั้นจะตายก่อนถูกโหวตเผา
แวมไพร์จะไม่ถูกหมาป่าสังหาร จะถูกสังหารเมื่อโหวตเผาเพียงอย่างเดียว
<br>
*หมายเหตุ ไม่ได้อยู่ทั้งฝ่ายหมาป่า และชาวบ้าน',
                'image' => '1',
                'point' => -8,
                'created_at' => '2017-07-08 15:05:31',
                'updated_at' => '2017-07-08 15:20:26',
            ),
            21 => 
            array (
                'id' => 23,
                'name' => 'หมาป่าเดียวดาย',
                'effect' => 'ตื่นขึ้นพร้อมกับหมาป่า แต่จะชนะได้ก็ต่อเมื่อ อยู่รอดเป็นคนสุดท้ายของเกม',
                'image' => '1',
                'point' => -5,
                'created_at' => '2017-07-08 15:09:33',
                'updated_at' => '2017-07-08 15:09:33',
            ),
            22 => 
            array (
                'id' => 24,
                'name' => 'สมุนรับใช้',
                'effect' => 'รู้ว่าใครเป็น หมาป่า แต่ไม่สามารถตื่นเวลากลางคืนได้',
                'image' => '1',
                'point' => -6,
                'created_at' => '2017-07-08 15:16:02',
                'updated_at' => '2017-07-08 15:16:02',
            ),
            23 => 
            array (
                'id' => 25,
                'name' => 'แม่มดเฒ่า',
                'effect' => 'ใน 1 คืน สามารถเลือกผู้เล่น 1 คน แล้วคนนั้นจะออกจากหมู่บ้านไป จนกว่าจะคืนถัดไป',
                'image' => '1',
                'point' => 1,
                'created_at' => '2017-07-08 15:20:14',
                'updated_at' => '2017-07-08 15:20:14',
            ),
        ));
        
        
    }
}