@extends('layouts.app')

@section('title', "Guide")

@section('content')
    <div class = "container">
        <div class="row">
            ในการเล่น จะเล่นเป็นรอบๆ เป็นรอบละ 1 วัน โดย 1 วัน จะประกอบด้วย ช่วงกลางวันและช่วงกลางคืน
            <br>
            <br>
            1. ช่วงกลางวัน
            <br>
            - ทุกคนลืมตาพร้อมกัน ดูว่ามีใครตายจากไป จากนั้นก็ให้พุดคุยกัน เพื่อหาว่าใครเป็นฆาตกร โดยผู้เล่นจะบอกว่าเราเป็นตัวละครอะไรไปเลยก็ได้ จะโกหกก็ได้
            <br>
            - ต่อมาโหวตเผาผู้ต้องสงสัย หากใครโดนโหวตมากที่สุด จะมีโอกาสแก้ตัว 1 ครั้ง ถ้าทุกคนสงสารก็จะมีการโหวตใหม่ แต่ถ้าทุกคนยืนยันว่าจะเผาคนนี้ ก็เผาเลย
            <br>
            - ถ้ามีการโหวตใหม่ จะให้โอกาสพูดคุยกัน แล้วโหวตผู้ต้องสงสัยใหม่ คราวนี้ใครโดนโหวตมากสุด จะไม่มีโอกาสแก้ตัวแล้ว โดนเผาตายเลย
            <br>
            - ใครที่ตายไปแล้ว ห้ามมีส่วนร่วมเกี่ยวกับเกม ห้ามมาให้คำแนะนำหรือพูดคุยกับคนที่ยังไม่ตาย
            <br>
            <br>
            2. ช่วงกลางคืน
            <br>
            - ทุกคนจำเป็นต้องหลับตา ยกเว้น Moderator โดย Moderator จะสามารถสั่งให้ผู้ที่มีความสามารถช่วงกลางคืนลืมตา แล้วทำตามความสามารถนั้นๆ
            <br>
            - ทุกคืนหมาป่าจะต้องตกลงกันเองว่าจะเลือกสังหารใคร โดยสังหารได้คืนละ 1 คน
            <br>
            <br>
            เกมจะจบลงก็ต่อเมื่อ
            <br>
            ฝ่ายหมาป่าชนะ  คือ มีจำนวนชาวบ้านเท่ากับจำนวนหมาป่า
            <br>
            ฝ่ายชาวบ้านชนะ คือ ไม่มีหมาป่าเหลืออยู่ในเกม
            <br>
            <br>
            <br>
            *** หมายเหตุ ใน 1 เกม
            <br>
            จะมีผู้เล่นเป็นหมาป่า ได้สูงสุด 12 คน
            <br>
            เป็นชาวบ้าน ได้สูงสุด 15 คน
            <br>
            เป็นแวมไพร์ ได้สูงสุด 8 คน
            <br>
            เป็นช่างก่อสร้าง ได้สูงสุด 3 คน
            <br>
            และ มีผู้เล่นเป็นตัวละครอื่น ได้ตัวละคนละสูงสุด 1 คน เท่านั้น
        </div>
    </div>
@stop