@extends('layouts.app')

@section('title', "Guide")

@section('content')
    <div class = "container">
        <div class="row">
            การเล่น จะเล่นเป็นรอบๆ รอบหนึ่งวันประกอบด้วยช่วงกลางวันและช่วงกลางคืน
            <br>
            ช่วงกลางวัน (day) เป็นช่วงที่สมาชิกหมู่บ้านทั้งหมดทำการล่ามนุษย์หมาป่า จบช่วงกลางวันโดยการโหวตสมาชิกในหมู่บ้านว่าใครเป็นมนุษย์หมาป่า
            <br>
            คนที่ถูกโหวตด้วยเสียงข้างมากจะถูกเผาและเปลี่ยนสภาพเป็นคนตาย
            <br>
            ช่วงกลางคืน (night) เป็นช่วงที่มนุษย์หมาป่าออกล่าเหยื่อ มนุษย์หมาป่าจะประชุมกันว่าจะกินใคร นอกจากนี้จะมีความสามารถ (ability) ของสมาชิกบางบทบาทที่จะแสดงออกในช่วงกลางคืน
            <br>
            รอบเวลากลางวันกำหนดให้ สมาชิกใช้เวลาล่ามนุษย์หมาป่าได้นานที่สุด 40 นาที หรือแล้วแต่จะกำหนดกันเอง จากนั้นจะปิดโหวตตามจำนวนเสียงที่มีอยู่
            <br>
            ส่วนรอบกลางคืนขอจำกัดเวลาในการ ใช้ ability ต่างๆภายใน 20 นาทีหรือแล้วแต่จะกำหนดกันเอง โดยยึดความสำคัญที่สุดสำหรับการตัดสินใจของมนุษย์หมาป่า (หากมีบทบาทอื่นที่ไม่ตอบรับการใช้ ability ภายใน 20 นาทีนี้จะข้ามไปเฟสกลางวันโดยไม่รออีกต่อไป

        </div>
    </div>
@stop